---
title: Redis 시작하기 - Hashes
categories:
  - cache
tags:
  - redis
  - jupyter
---

## Hashes
Redis 해시는 필드-값 쌍을 사용하여 "해시"가 어떻게 보이는지 정확히 보여줍니다.:  
```bash
> hset user:1000 username antirez birthyear 1977 verified 1
(integer) 3
> hget user:1000 username
"antirez"
> hget user:1000 birthyear
"1977"
> hgetall user:1000
1) "username"
2) "antirez"
3) "birthyear"
4) "1977"
5) "verified"
6) "1"
```
해시는 객체를 나타내는 데 편리하지만 실제로 해시 안에 넣을 수있는 필드 수에는 사용 가능한 메모리 이외의 실질적인 제한이 없으므로 응용 프로그램 내에서 다양한 방법으로 해시를 사용할 수 있습니다.  
[HSET](https://redis.io/commands/hset) 명령은  해시의 여러 필드를 설정하는 반면 HGET는 단일 필드를 검색합니다.  

[HMGET](https://redis.io/commands/hmget)은 HGET와 유사  하지만 값 배열을 반환합니다.:  
```bash
> hmget user:1000 username birthyear no-such-field
1) "antirez"
2) "1977"
3) (nil)
```

[HINCRBY](https://redis.io/commands/hincrby)와 같이 개별 필드에 대한 작업을 수행 할 수있는 명령도 있습니다.:
```bash
> hincrby user:1000 birthyear 10
(integer) 1987
> hincrby user:1000 birthyear 10
(integer) 1997
```
설명서에서 해시 명령의 전체 목록을 찾을 수 있습니다.
작은 해시 (즉, 작은 값을 가진 몇 가지 요소)가 메모리에서 특별한 방식으로 인코딩되어 메모리 효율이 매우 높다는 점은 주목할 가치가 있습니다.
